spec/html_examples/code-syntax.html
<h1 class="title">Code syntax</h1>
<h2>No language selected</h2>
<pre class="src">
<code class="">
Nothing to see here
</code>
</pre>
<h2>CSS example</h2>
<pre class="src">
<code class="css">
 <span style="color:#339;font-weight:bold">*</span> {
  <span style="color:#777">/* apply a natural box layout model to all elements */</span>
  <span style="color:#339;font-weight:bold">box-sizing</span>: <span style="color:#339;font-weight:bold">border-box</span>; 
  <span style="color:#339;font-weight:bold">-moz-box-sizing</span>: <span style="color:#339;font-weight:bold">border-box</span>; 
  <span style="color:#339;font-weight:bold">-webkit-box-sizing</span>: <span style="color:#339;font-weight:bold">border-box</span>; 
 }
</code>
</pre>
<h2>HTML example</h2>
<pre class="src">
<code class="html">
<span style="color:#070">&lt;html&gt;</span>
  <span style="color:#070">&lt;head&gt;</span>
    <span style="color:#070">&lt;title&gt;</span>Hello<span style="color:#070">&lt;/title&gt;</span>
  <span style="color:#070">&lt;/head&gt;</span>
  <span style="color:#070">&lt;body&gt;</span>
    <span style="color:#070">&lt;h1&gt;</span>Hello<span style="color:#070">&lt;/h1&gt;</span>


  <span style="color:#070">&lt;/body&gt;</span>
<span style="color:#070">&lt;/html&gt;</span>
</code>
</pre>
<h2>Ruby example</h2>
<pre class="src">
<code class="ruby">
<span style="color:#080;font-weight:bold">class</span> <span style="color:#B06;font-weight:bold">Post</span> &lt;&lt; <span style="color:#036;font-weight:bold">ActiveRecord</span>::<span style="color:#036;font-weight:bold">Base</span>
  <span style="color:#080;font-weight:bold">def</span> <span style="color:#06B;font-weight:bold">print_title</span>
    puts <span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">&quot;</span><span style="background-color:hsla(0,0%,0%,0.07);color:black"><span style="font-weight:bold;color:#666">#{</span><span style="color:#069">self</span>.title<span style="font-weight:bold;color:#666">}</span></span><span style="color:#710">&quot;</span></span>
  <span style="color:#080;font-weight:bold">end</span>
<span style="color:#080;font-weight:bold">end</span>
</code>
</pre>
<h2>Python example</h2>
<pre class="src">
<code class="python">
<span style="color:#080;font-weight:bold">import</span> <span style="color:#B44;font-weight:bold">mapnik</span>

m = mapnik.Map(<span style="color:#00D">600</span>, <span style="color:#00D">800</span>)
m.background = Map.Color(<span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">'</span><span style="color:#D20">steelblue</span><span style="color:#710">'</span></span>)
</code>
</pre>
<h2>Javascript example</h2>
<pre class="src">
<code class="javascript">
exports = <span style="color:#963">this</span>;

(<span style="color:#080;font-weight:bold">function</span>(<span style="color:#369;font-weight:bold">$</span>){

<span style="color:#080;font-weight:bold">var</span> Posts = {};

Posts.<span style="color:#06B;font-weight:bold">index</span> = <span style="color:#080;font-weight:bold">function</span>(){
<span style="color:#777">// TODO</span>
};

})(jQuery);
</code>
</pre>
<h2>JSON example</h2>
<pre class="src">
<code class="json">
{ <span style="color:#F00;background-color:#FAA">n</span><span style="color:#F00;background-color:#FAA">a</span><span style="color:#F00;background-color:#FAA">m</span><span style="color:#F00;background-color:#FAA">e</span>: <span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">&quot;</span><span style="color:#D20">Wally</span><span style="color:#710">&quot;</span></span>
, <span style="color:#F00;background-color:#FAA">s</span><span style="color:#F00;background-color:#FAA">u</span><span style="color:#F00;background-color:#FAA">r</span><span style="color:#F00;background-color:#FAA">n</span><span style="color:#F00;background-color:#FAA">a</span><span style="color:#F00;background-color:#FAA">m</span><span style="color:#F00;background-color:#FAA">e</span>: <span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">&quot;</span><span style="color:#D20">Quevedo</span><span style="color:#710">&quot;</span></span>
}
</code>
</pre>
<h2>PHP example</h2>
<pre class="src">
<code class="php">
<span style="color:#369;font-weight:bold">echo</span> <span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">&quot;</span><span style="color:#D20">Hello</span><span style="color:#710">&quot;</span></span>;
<span style="color:#369;font-weight:bold">phpinfo</span>();
<span style="color:#369;font-weight:bold">var_dump</span>(some_var);
</code>
</pre>
<h2>Elisp example</h2>
<pre class="src">
<code class="scheme">
(defun hello()
  (interactive)
  (message &quot;hello&quot;))
</code>
</pre>
<h2>Not supported language example</h2>
<pre class="src">
<code class="notsupported">
!+!+++!++!++!++!+
</code>
</pre>
